# written by Alan Bannon
# adapted for Cadence RTL Compiler (rc)
# adapted for traffic_light module
# ======================================
# Search paths
# ======================================
set_attribute hdl_search_path ../RTL
set_attribute lib_search_path ../Lib/GPDK045/timing
# ======================================
# Library
# ======================================
set_attribute library {slow_vdd1v0_basiccells.lib typical.lib }
set_attribute information_level 6
set_attribute hdl_error_on_blackbox true
# ======================================
# HDL files
# ======================================
set myFiles [list top_module.v clk_1hz.v fsm.v display_2digit.v]
# ======================================
# Design / timing setup
# ======================================
set basename top_module
set myClk clk_50mhz
set myPeriod_ps 20000
set myInDelay_ps  1000
set myOutDelay_ps 1000
set runname slow
# ======================================
# Read & Elaborate
# ======================================
read_hdl -v2001 ${myFiles}
elaborate ${basename}
# ======================================
# Clock & Constraints
# ======================================
define_clock -period ${myPeriod_ps} -name ${myClk} [clock_ports]
external_delay -input  ${myInDelay_ps}  -clock ${myClk} [find / -port ports_in/*]
external_delay -output ${myOutDelay_ps} -clock ${myClk} [find / -port ports_out/*]
# ======================================
# Design checks
# ======================================
check_design -unresolved
report timing -lint
# ======================================
# Synthesis
# ======================================
synthesize -to_mapped -effort medium
# ======================================
# Reports
# ======================================
report timing > ${basename}_${runname}_timing.rep
report gates  > ${basename}_${runname}_cell.rep
report power  > ${basename}_${runname}_power.rep
report area   > ${basename}_${runname}_area.rep
# ======================================
# Outputs
# ======================================
write_hdl -mapped > ${basename}_${runname}.v
write_sdc         > ${basename}_${runname}.sdc
# ======================================
# GUI
# ======================================
gui_show
