# ####################################################################

#  Created by Encounter(R) RTL Compiler v12.10-s012_1 on Tue Jul 21 18:46:26 +0600 2026

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design top_module

create_clock -name "clk_50mhz" -add -period 20.0 -waveform {0.0 10.0} [get_ports clk_50mhz]
set_load -pin_load 0.05 [get_ports {LED_1[2]}]
set_load -pin_load 0.05 [get_ports {LED_1[1]}]
set_load -pin_load 0.05 [get_ports {LED_1[0]}]
set_load -pin_load 0.05 [get_ports {LED_2[2]}]
set_load -pin_load 0.05 [get_ports {LED_2[1]}]
set_load -pin_load 0.05 [get_ports {LED_2[0]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[6]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[5]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[4]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[3]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[2]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[1]}]
set_load -pin_load 0.05 [get_ports {seg1_ch[0]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[6]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[5]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[4]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[3]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[2]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[1]}]
set_load -pin_load 0.05 [get_ports {seg1_dv[0]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[6]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[5]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[4]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[3]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[2]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[1]}]
set_load -pin_load 0.05 [get_ports {seg2_ch[0]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[6]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[5]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[4]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[3]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[2]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[1]}]
set_load -pin_load 0.05 [get_ports {seg2_dv[0]}]
set_false_path -from [get_ports rst]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {LED_1[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {LED_1[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {LED_1[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {LED_2[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {LED_2[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {LED_2[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_ch[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg1_dv[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_ch[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -max 2.0 [get_ports {seg2_dv[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {LED_1[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {LED_1[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {LED_1[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {LED_2[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {LED_2[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {LED_2[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_ch[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg1_dv[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_ch[0]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[6]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[5]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[4]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[3]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[2]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[1]}]
set_output_delay -clock [get_clocks clk_50mhz] -add_delay -min 0.5 [get_ports {seg2_dv[0]}]
set_max_fanout 16.000 [current_design]
set_max_transition 0.2 [current_design]
set_dont_use [get_lib_cells gpdk045bc/HOLDX1]
set_clock_uncertainty -setup 0.2 [get_clocks clk_50mhz]
set_clock_uncertainty -hold 0.2 [get_clocks clk_50mhz]
